workspace/controllers/CartController.php

SELECT * FROM `shop_user` WHERE username = 'imooc_5954df2269fb2'
SELECT * FROM `shop_cart` WHERE userid = '7'
SELECT * FROM `shop_product` WHERE productid = '13'
---
     public function actionIndex()
    {
        if(Yii::$app->session['isLogin'] != 1)
        {
            return $this->redirect(['member/auth']);
        }
        $userid = User::find()->where('username = :name',[':name' => Yii::$app->session['loginname']])->one()->userid;
        $cart = Cart::find()->where('userid = :uid',[':uid' => $userid])->asArray()->all();
        $data = [];
        foreach($cart as $k => $pro)
        {
            $product = Product::find()->where('productid = :pid',[':pid' => $pro['productid']])->one();

SELECT * FROM `shop_user` WHERE username = 'imooc_5954df2269fb2'
SELECT * FROM `shop_product` WHERE productid = '13'
SELECT * FROM `shop_cart` WHERE productid = '13' and userid = '7'
INSERT INTO `shop_cart` (`productid`, `productnum`, `price`, `userid`, `createtime`) VALUES ('13', 1, '2499.00', '7', 1499594446)
---
     public function actionAdd()
    {
        if(Yii::$app->session['isLogin'] != 1)
        {
            return $this->redirect(['member/auth']);
        }
        $userid = User::find()->where('username = :name', [':name' => Yii::$app->session['loginname']])->one()->userid;
        if(Yii::$app->request->isPost)
        {
            $post = Yii::$app->request->post();
            $num = Yii::$app->request->post()['productnum'];
            $data['Cart'] = $post;
            $data['Cart']['userid'] = $userid;
        }
        if(Yii::$app->request->isGet)
        {
            $productid = Yii::$app->request->get('productid');
            $model = Product::find()->where('productid = :pid',[':pid' => $productid])->one();
            $price = $model->issale ? $model->saleprice : $model->price;
            $num = 1;
            $data['Cart'] = ['productid' => $productid, 'productnum' => $num, 'price' => $price, 'userid' => $userid];
        }
        if(!$model = Cart::find()->where('productid = :pid and userid = :uid',[':pid' => $data['Cart']['productid'], ':uid' => $data['Cart']['userid']])->one())
        {
            $model = new Cart;
        }else{
            $data['Cart']['productnum'] = $model->productnum + $num;
        }
        $data['Cart']['createtime'] = time();
        $model->load($data);
        $model->save();

UPDATE `shop_cart` SET `productnum`=0 WHERE cartid = NULL
---
     public function actionMod()
     {
        $cartid = Yii::$app->request->get('cartid');
        $productnum = Yii::$app->request->get('productnum');
        Cart::updateAll(['productnum' => $productnum],'cartid = :cid', [':cid' => $cartid]);