workspace/controllers/CommonController.php

    public function init()
    {
        $menu = Category::getMenu;
        $this->view->params['menu'] = $menu;
        $data['products'] = [];
        $total = 0;
        if(Yii::$app->session['isLogin'])
        {
            $userid = User::find()->where('username = :username',[':username' => Yii::$app->session['loginname']])->one()->userid;
            if($userid)
            {
                $carts = Cart::find()->where('userid  = :uid',[':uid' => $userid])->asArray()->all();
                foreach($carts as $k=>$pro)
                {
                    $product = Product::find()->where('productid = :pid',[':pid' => $pro['productid']])->one();
---
SELECT * FROM `shop_user` WHERE username = 'imooc_5954df2269fb2'
SELECT * FROM `shop_cart` WHERE userid  = '7'
SELECT * FROM `shop_product` WHERE productid = '13'