workspace/controllers/OrderController.php

SELECT * FROM `shop_user` WHERE username = 'imooc_5954df2269fb2' or useremail = 'imooc_5954df2269fb2'
---
      public function actionIndex()
      {
        $this->layout = 'layout2';
        if(Yii::$app->session['isLogin'] != 1)
        {
            return $this->redirect(['member/auth']);
        }
        $loginname = Yii::$app->session['loginname'];
        $userid = User::find()->where('username = :name or useremail = :email',[':name' => $loginname, ':email' => $loginname])->one()->userid;

SELECT * FROM `shop_order` WHERE orderid = '16'
SELECT * FROM `shop_user` WHERE username = 'imooc_5954df2269fb2' or useremail = 'imooc_5954df2269fb2'
SELECT * FROM `shop_address` WHERE userid = '7'
SELECT * FROM `shop_order_detail` WHERE orderid = '16'
SELECT * FROM `shop_product` WHERE productid = '13'
---
     public function actionCheck()
     {
         $this->layout = 'layout1';
         if(Yii::$app->session['isLogin'] !=1)
         {
             return $this->redirect(['member/auth']);
         }
         $orderid = Yii::$app->request->get('orderid');
         $status  = Order::find()->where('orderid = :oid',[':oid' => $orderid])->one()->status;
         if($status != Order::CREATEORDER && $status != Order::CHECKORDER)
         {
             return $this->redirect(['order/index']);
         }
         $loginname = Yii::$app->session['loginname'];
         $userid = User::find()->where('username = :name or useremail = :email',[':name' => $loginname, ':email' => $loginname])->one()->userid;
         $addresses = Address::find()->where('userid = :uid',[':uid' => $userid])->asArray()->all();
         $details = OrderDetail::find()->where('orderid = :oid', [':oid' => $orderid])->asArray()->all();
         $data = [];
         foreach($details as $detail)
         {
             $model = Product::find()->where('productid = :pid', [':pid' => $detail['productid']])->one();

SELECT * FROM `shop_user` WHERE username = 'imooc_5954df2269fb2' or useremail = 'imooc_5954df2269fb2'
---
      public function actionAdd()
      {
          if(Yii::$app->session['isLogin'] != 1)
          {
              return $this->redirect(['member/auth']);
          }
          $transaction = Yii::$app->db->beginTransaction();
          try{
              if(Yii::$app->request->isPost)
              {
                  $post = Yii::$app->request->post();
                  $ordermodel = new Order;
                  $ordermodel->scenario = 'add';
                  $usermodel = User::find()->where('username = :name or useremail = :email',[':name' => Yii::$app->session['loginname'], ':email' => Yii::$app->session['loginname']])->one();

SELECT * FROM `shop_user` WHERE username = 'imooc_5954df2269fb2' or useremail = 'imooc_5954df2269fb2'
---
     public function actionConfirm()
     {
         try{
             if(Yii::$app->session['isLogin'] != 1)
             {
                 return $this->redirect(['member/auth']);
             }
             if(!Yii::$app->request->isPost)
             {
                 throw new \Exception();
             }
             $post = Yii::$app->request->post();
             $loginname = Yii::$app->request->session['loginname'];
             $usermodel = User::find()->where('username = :name or useremail = :email',[':name' => $loginname, ':email' => $loginname])->one();