workspace/modules/controllers/ManageController.php

SELECT * FROM `shop_admin` LIMIT 10
---
     public function actionManagers()
     {
         $this->layout = 'layout1';
         $admin_model = Admin::find();
         $count = $admin_model->count();
         $pageSize = Yii::$app->params['pageSize']['manage'];
         $pager = new Pagination(['totalCount' => $count, 'pageSize' => $pageSize]);
         $managers = $admin_model->offset($pager->offset)->limit($pager->limit)->all();