workspace/modules/controllers/ManageController.php

SELECT * FROM `shop_admin`
SELECT COUNT(*) FROM `shop_admin`
SELECT * FROM `shop_admin` ORDER BY `adminid` DESC LIMIT 10
---
     public function actionManagers()
     {
         $this->layout = 'layout1';
         $admin_model = Admin::find();
         $count = $admin_model->count();
         $pageSize = Yii::$app->params['pageSize']['manage'];
         $pager = new Pagination(['totalCount' => $count, 'pageSize' => $pageSize]);
         $managers = $admin_model->offset($pager->offset)->limit($pager->limit)->orderBy('adminid desc')->all();

SELECT * FROM `shop_admin` WHERE adminuser = 'admin'
---
      public function actionChangeemail()
      {
          $this->layout = 'layout1';
          $model = Admin::find()->where('adminuser = :user',[':user' => Yii::$app->session['admin']['adminuser']])->one();

SELECT * FROM `shop_admin` WHERE adminuser = 'admin'
---
       public function actionChangepass()
       {
           $this->layout = 'layout1';
           $model = Admin::find()->where("adminuser = :user",[':user' => Yii::$app->session['admin']['adminuser']])->one();