workspace/modules/controllers/OrderController.php

    public function actionList()
    {
        $this->layout = 'layout1';
        $model = Order::find();
        $count = $model->count();
        $pageSize = Yii::$app->params['pageSize']['order'];
        $pager = new Pagination(['totalCount' => $count, 'pageSize' => $pageSize]);
        $data = $model->offset($pager->offset)->limit($pager->limit)->all();
---
SELECT COUNT(*) FROM `shop_order`
SELECT * FROM `shop_order` LIMIT 10