workspace/modules/controllers/UserController.php

    public function actionUsers()
    {
        $this->layout = 'layout1';
        $model = User::find()->joinWith('profile');
        $count = $model->count();
        $pageSize = Yii::$app->params['pageSize']['user'];
        $pager = new Pagination(['totalCount' => $count, 'pageSize' => $pageSize]);
        $users = $model->offset($pager->offset)->limit($pager->limit)->all();
---
SELECT COUNT(*) FROM `shop_user` LEFT JOIN `shop_profile` ON `shop_user`.`userid` = `shop_profile`.`userid`
SELECT * FROM `shop_profile` WHERE `userid` IN ('3', '4')
SELECT `shop_user`.* FROM `shop_user` LEFT JOIN `shop_profile` ON `shop_user`.`userid` = `shop_profile`.`userid` LIMIT 10

      public function actionDel()
      {
          try{
              $userid = (int)Yii::$app->request->get('userid');
              if(empty($userid))
              {
                  throw new Exception();
              }

              $trans = Yii::$app->db->beginTransaction();
              if($obj = Profile::find()->where("userid = :userid",['userid' => $userid])->one())
              {
                  $res = Profile::deleteAll("userid = :userid",[':userid' => $userid]);
                  if(empty($res))
                  {
                      throw new Exception();
                  }
              }

              if(!User::deleteAll('userid = :userid',[':userid' => $userid]))
---
SELECT * FROM `shop_profile` WHERE userid = 2
DELETE FROM `shop_user` WHERE userid = 2