workspace/modules/models/Admin.php

    public function validatePass()
    {
        if(!$this->hasErrors())
        {
            $data = self::find()->where('adminuser = :user and adminpass = :pass',[":user" => $this->adminuser,":pass" => md5($this->adminpass)])->one();
---
SELECT * FROM `shop_admin` WHERE adminuser = 'admin' and adminpass = '202cb962ac59075b964b07152d234b70'

     public function validateEmail()
     {
         if(!$this->hasErrors())
         {
            $userInfo = self::find()->where('adminuser = :user and adminemail = :email',[':user' => $this->adminuser,':email' => $this->adminemail])->one();
---
SELECT * FROM `shop_admin` WHERE adminuser = 'admin' and adminemail = 'niushiyao@ucse.net'

    public function login($data)
    {
        $this->scenario = 'login';
        if($this->load($data) && $this->validate())
---
SELECT * FROM `shop_admin` WHERE adminuser = 'admin123' and adminemail = 'yiishop@imooc.com'

       public function changePass($data)
       {
           $this->scenario = 'changepass';
           if($this->load($data) && $this->validate())
           {
               return (bool)$this->updateAll(['adminpass' => md5($this->adminpass)],'adminuser = :user',[':user' => $this->adminuser] );
---
UPDATE `shop_admin` SET `adminpass`='0192023a7bbd73250516f069df18b500' WHERE adminuser = 'admin'