workspace/modules/models/Admin.php

UPDATE `shop_admin` SET `adminpass`='e10adc3949ba59abbe56e057f20f883e' WHERE adminuser = 'admin'
---
       public function changePass($data)
       {
           $this->scenario = 'changepass';
           if($this->load($data) && $this->validate())
           {
               return (bool)$this->updateAll(['adminpass' => md5($this->adminpass)],'adminuser = :user',[':user' => $this->adminuser] );