workspace/modules/models/Category.php

INSERT INTO `shop_category` (`parentid`, `title`, `createtime`) VALUES ('8', 'apple', 1498895571)
---
     public function add($data)
     {
         $data['Category']['createtime'] = time();
         if($this->load($data) && $this->save())

SELECT * FROM `shop_category`
---
      public function getData()
      {
          $cates = self::find()->all();

SELECT * FROM `shop_category` WHERE parentid = 0
SELECT * FROM `shop_category` WHERE parentid = '7'
---
     public function getMenu()
     {
         $top = self::find()->where('parentid = :pid',[':pid' => 0])->asArray->all();
         $data = [];
         foreach((array)$top as $k => $cate)
         {
            $cate['children'] = self::find()->where('parentid = :pid', [":pid" => $cate['cateid']])->asArray->all();