workspace/modules/models/Order.php

    public static function getData($order)
    {
       $details = OrderDetail::find()->where('orderid = :oid', [':oid' => $order->orderid])->all();
       $products = [];
       foreach($details as $detail)
       {
           $product = Product::find()->where('productid = :pid',[':pid' => $detail->productid])->one();
           $product->num = $detail->productnum;
           $products[] = $product;
       }
       $order->products = $products;
       $order->username = User::find()->where('userid = :uid',[':uid' => $order->userid])->one()->username;
       $order->address = Address::find()->where('addressid = :aid',[':aid' => $order->addressid])->one();
---
SELECT * FROM `shop_order_detail` WHERE orderid = '1'
SELECT * FROM `shop_product` WHERE productid = '7'
SELECT * FROM `shop_user` WHERE userid = '1'
SELECT * FROM `shop_address` WHERE addressid = '2'